__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 28, 28, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 16)   144         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 28, 28, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 28, 28, 16)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 16)   2304        re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 28, 28, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 28, 28, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 16)   2304        re_lu_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 28, 28, 32)   0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 28, 32)   128         concatenate_1[0][0]              
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 28, 28, 32)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 28, 28, 16)   4608        re_lu_3[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 28, 28, 48)   0           concatenate_1[0][0]              
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 28, 28, 48)   192         concatenate_2[0][0]              
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 28, 28, 48)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 28, 28, 16)   6912        re_lu_4[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 28, 28, 64)   0           concatenate_2[0][0]              
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 28, 28, 64)   256         concatenate_3[0][0]              
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 28, 28, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 28, 28, 16)   9216        re_lu_5[0][0]                    
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 28, 28, 80)   0           concatenate_3[0][0]              
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 28, 28, 80)   320         concatenate_4[0][0]              
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 28, 28, 80)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 16)   11520       re_lu_6[0][0]                    
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 28, 28, 96)   0           concatenate_4[0][0]              
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 28, 28, 96)   384         concatenate_5[0][0]              
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 28, 28, 96)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 28, 28, 16)   13824       re_lu_7[0][0]                    
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 28, 28, 112)  0           concatenate_5[0][0]              
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 28, 28, 112)  448         concatenate_6[0][0]              
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 28, 28, 112)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 28, 28, 16)   16128       re_lu_8[0][0]                    
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 28, 28, 128)  0           concatenate_6[0][0]              
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 28, 28, 128)  512         concatenate_7[0][0]              
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 28, 28, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 28, 28, 144)  18432       re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 28, 28, 144)  576         conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 28, 28, 144)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 28, 28, 16)   20736       re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 28, 28, 16)   64          conv2d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 28, 28, 16)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 28, 16)   2304        re_lu_11[0][0]                   
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 28, 28, 32)   0           conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 28, 28, 32)   128         concatenate_8[0][0]              
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 28, 28, 32)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 28, 28, 16)   4608        re_lu_12[0][0]                   
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 28, 28, 48)   0           concatenate_8[0][0]              
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 28, 28, 48)   192         concatenate_9[0][0]              
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 28, 28, 48)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 28, 28, 16)   6912        re_lu_13[0][0]                   
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 28, 28, 64)   0           concatenate_9[0][0]              
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 28, 28, 64)   256         concatenate_10[0][0]             
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 28, 28, 64)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 28, 28, 16)   9216        re_lu_14[0][0]                   
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 28, 28, 80)   0           concatenate_10[0][0]             
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 28, 28, 80)   320         concatenate_11[0][0]             
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 28, 28, 80)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 28, 28, 16)   11520       re_lu_15[0][0]                   
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 28, 28, 96)   0           concatenate_11[0][0]             
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 28, 28, 96)   384         concatenate_12[0][0]             
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 28, 28, 96)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 28, 28, 16)   13824       re_lu_16[0][0]                   
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 28, 28, 112)  0           concatenate_12[0][0]             
                                                                 conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 28, 28, 112)  448         concatenate_13[0][0]             
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 28, 28, 112)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 28, 28, 16)   16128       re_lu_17[0][0]                   
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 28, 28, 128)  0           concatenate_13[0][0]             
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 28, 28, 128)  512         concatenate_14[0][0]             
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 28, 28, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 28, 28, 272)  34816       re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 28, 28, 272)  1088        conv2d_19[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 28, 28, 272)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 28, 28, 16)   39168       re_lu_19[0][0]                   
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 28, 28, 16)   64          conv2d_20[0][0]                  
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 28, 28, 16)   0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 28, 28, 16)   2304        re_lu_20[0][0]                   
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 28, 28, 32)   0           conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 28, 28, 32)   128         concatenate_15[0][0]             
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 28, 28, 32)   0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 28, 28, 16)   4608        re_lu_21[0][0]                   
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 28, 28, 48)   0           concatenate_15[0][0]             
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 28, 28, 48)   192         concatenate_16[0][0]             
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 28, 28, 48)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 28, 28, 16)   6912        re_lu_22[0][0]                   
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 28, 28, 64)   0           concatenate_16[0][0]             
                                                                 conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 28, 28, 64)   256         concatenate_17[0][0]             
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 28, 28, 64)   0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 28, 28, 16)   9216        re_lu_23[0][0]                   
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 28, 28, 80)   0           concatenate_17[0][0]             
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 28, 28, 80)   320         concatenate_18[0][0]             
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 28, 28, 80)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 28, 28, 16)   11520       re_lu_24[0][0]                   
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 28, 28, 96)   0           concatenate_18[0][0]             
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 28, 28, 96)   384         concatenate_19[0][0]             
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 28, 28, 96)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 28, 28, 16)   13824       re_lu_25[0][0]                   
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 28, 28, 112)  0           concatenate_19[0][0]             
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 28, 28, 112)  448         concatenate_20[0][0]             
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 28, 28, 112)  0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 28, 28, 16)   16128       re_lu_26[0][0]                   
__________________________________________________________________________________________________
concatenate_21 (Concatenate)    (None, 28, 28, 128)  0           concatenate_20[0][0]             
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 28, 28, 128)  512         concatenate_21[0][0]             
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 28, 28, 128)  0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 28, 28, 400)  51200       re_lu_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 28, 28, 400)  1600        conv2d_28[0][0]                  
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 28, 28, 400)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 28, 28, 16)   57600       re_lu_28[0][0]                   
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 28, 28, 16)   64          conv2d_29[0][0]                  
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 28, 28, 16)   0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 28, 28, 16)   2304        re_lu_29[0][0]                   
__________________________________________________________________________________________________
concatenate_22 (Concatenate)    (None, 28, 28, 32)   0           conv2d_29[0][0]                  
                                                                 conv2d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 28, 28, 32)   128         concatenate_22[0][0]             
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 28, 28, 32)   0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 28, 28, 16)   4608        re_lu_30[0][0]                   
__________________________________________________________________________________________________
concatenate_23 (Concatenate)    (None, 28, 28, 48)   0           concatenate_22[0][0]             
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 28, 28, 48)   192         concatenate_23[0][0]             
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 28, 28, 48)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 28, 28, 16)   6912        re_lu_31[0][0]                   
__________________________________________________________________________________________________
concatenate_24 (Concatenate)    (None, 28, 28, 64)   0           concatenate_23[0][0]             
                                                                 conv2d_32[0][0]                  
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 28, 28, 64)   256         concatenate_24[0][0]             
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 28, 28, 64)   0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 28, 28, 16)   9216        re_lu_32[0][0]                   
__________________________________________________________________________________________________
concatenate_25 (Concatenate)    (None, 28, 28, 80)   0           concatenate_24[0][0]             
                                                                 conv2d_33[0][0]                  
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 28, 28, 80)   320         concatenate_25[0][0]             
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, 28, 28, 80)   0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 28, 28, 16)   11520       re_lu_33[0][0]                   
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 28, 28, 96)   0           concatenate_25[0][0]             
                                                                 conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 28, 28, 96)   384         concatenate_26[0][0]             
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 28, 28, 96)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 28, 28, 16)   13824       re_lu_34[0][0]                   
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 28, 28, 112)  0           concatenate_26[0][0]             
                                                                 conv2d_35[0][0]                  
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 28, 28, 112)  448         concatenate_27[0][0]             
__________________________________________________________________________________________________
re_lu_35 (ReLU)                 (None, 28, 28, 112)  0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 28, 28, 16)   16128       re_lu_35[0][0]                   
__________________________________________________________________________________________________
concatenate_28 (Concatenate)    (None, 28, 28, 128)  0           concatenate_27[0][0]             
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 100352)       0           concatenate_28[0][0]             
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          20070600    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           2010        dense_1[0][0]                    
==================================================================================================
Total params: 20,567,090
Trainable params: 20,561,074
Non-trainable params: 6,016
__________________________________________________________________________________________________
