__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 28, 28, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 12)   108         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 28, 28, 12)   48          conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 28, 28, 12)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 12)   1296        re_lu_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 28, 28, 24)   0           conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 28, 28, 24)   96          concatenate_1[0][0]              
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 28, 28, 24)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 12)   2592        re_lu_2[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 28, 28, 36)   0           concatenate_1[0][0]              
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 28, 36)   144         concatenate_2[0][0]              
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 28, 28, 36)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 28, 28, 12)   3888        re_lu_3[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 28, 28, 48)   0           concatenate_2[0][0]              
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 28, 28, 48)   192         concatenate_3[0][0]              
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 28, 28, 48)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 28, 28, 12)   576         re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 28, 28, 12)   48          conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 28, 28, 12)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 28, 28, 12)   1296        re_lu_5[0][0]                    
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 28, 28, 24)   0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 28, 28, 24)   96          concatenate_4[0][0]              
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 28, 28, 24)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 12)   2592        re_lu_6[0][0]                    
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 28, 28, 36)   0           concatenate_4[0][0]              
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 28, 28, 36)   144         concatenate_5[0][0]              
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 28, 28, 36)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 28, 28, 12)   3888        re_lu_7[0][0]                    
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 28, 28, 48)   0           concatenate_5[0][0]              
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 28, 28, 48)   192         concatenate_6[0][0]              
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 28, 28, 48)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 28, 28, 12)   5184        re_lu_8[0][0]                    
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 28, 28, 60)   0           concatenate_6[0][0]              
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 28, 28, 60)   240         concatenate_7[0][0]              
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 28, 28, 60)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 28, 28, 12)   720         re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 28, 28, 12)   48          conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 28, 28, 12)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 28, 28, 12)   1296        re_lu_10[0][0]                   
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 28, 28, 24)   0           conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 28, 28, 24)   96          concatenate_8[0][0]              
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 28, 28, 24)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 28, 12)   2592        re_lu_11[0][0]                   
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 28, 28, 36)   0           concatenate_8[0][0]              
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 28, 28, 36)   144         concatenate_9[0][0]              
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 28, 28, 36)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 28, 28, 12)   3888        re_lu_12[0][0]                   
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 28, 28, 48)   0           concatenate_9[0][0]              
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 28, 28, 48)   192         concatenate_10[0][0]             
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 28, 28, 48)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 28, 28, 12)   5184        re_lu_13[0][0]                   
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 28, 28, 60)   0           concatenate_10[0][0]             
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 28, 28, 60)   240         concatenate_11[0][0]             
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 28, 28, 60)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 28, 28, 12)   6480        re_lu_14[0][0]                   
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 28, 28, 72)   0           concatenate_11[0][0]             
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 56448)        0           concatenate_12[0][0]             
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          11289800    flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           2010        dense_1[0][0]                    
==================================================================================================
Total params: 11,335,310
Trainable params: 11,334,350
Non-trainable params: 960
__________________________________________________________________________________________________
